# Exploring the Survey data
## Survey one

In [41]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text

#### Creating an engine to read data from postgres

In [42]:
username = 'postgres'
password = 'balcombe08'
host = 'localhost' # 123.231.15.124 if running the code on a local machine
port = '5432'  # Postgres port
database = 'lacuna'

#Create an engine instance
engine = create_engine(f'postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}')

In [27]:
# General query

query = 'SELECT * FROM raw.survey_wave_1'

df = pd.read_sql_query(query, engine)

df

,index,serialno,uniqueid,account_no,t_pdata_1,t_pdata_2,t_pdata_3,t_pdata_4,t_pdata_5,t_pdata_6,...,trimmer_availability,tile_cutter_machine_availability,sawing_machine_availability,wood_chipping_machine_availability,concrete_mixture_machine_availability,hair_cutting_machine_availability,generator_battery_availability,bouth_availability,grill_availability,la_unique_id
0,0,194742308,GAL005073,403289502,SOMAWANTHA M H T R*,09 MALWATTA TEMPLE RD* DANGEDARA GALLE* GALLE*,,,94718284752,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10403289502
1,1,194742589,GAL005050,402747807,NANDASIRI K L*,12 GANGARAMA CROSS RD* MAGALLE GALLE GALLE*,,,94762159101,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10402747807
2,2,194743000,GAL005036,402596205,THABREW H H P M J,"BAKE LENDS, KITULAMPITIYA GALLE* GALLE*",912222713,718411697,94718411697,smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10402596205
3,3,194743684,BOR007909,708273907,WEERASINGHE H D D G,"54/38, PIRIVENA RD BORALESGAMUWA",112810488,777474762,94777474762,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10708273907
4,4,194744078,KOL00924,107193504,S S ATHIKA,1/B/F/10/U/21 LAKSANDA SEVANA SALAMULLA KOLONN...,,,94763088064,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10107193504
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2801,2801,197059426,DAL001683,207904004,A S FERNANDO,425/7/1 ROYAL GARDEN-02 WANAWASALA KELANIYA .,,,94773030123,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10207904004
2802,2802,197059427,DAL001697,208077111,D K A N AMARASINGHE,42/2 WEERASINGHE MW WARAGODA KELANIYA .,,112912473,94718199721,smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10208077111
2803,2803,197059428,DAL001963,210911602,L W RUBASINGHE,146/2 NARAMMINIYA RD KELANIYA .,,761485986,94761485986,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10210911602
2804,2804,197059429,DAL001164,201513906,RAMANAYAKE A I K,"236/5, WEDAMULLA MW KELANIYA* 0",112915947,726303344,94765629251,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10201513906
2805,2805,197059430,DAL001112,200840508,UPALI K M*,DEWALA RD 667/17B* PETHIYAGODA KELANIYA* 0,,,94761445825,non_smart_meter,...,0,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10200840508

#### Converting .SAV files to .CSV

In [6]:
data = pd.read_spss("/lirneasia/projects/lacuna/data/raw/Survey_data/LECO_ElectricityUsage_(Client Data)_W1.SAV")
data.to_csv("/lirneasia/projects/lacuna/data/raw/Survey_data/LECO_ElectricityUsage_(Client Data)_W1.csv", index=False)

#### Reading survey data in a low memory mode

In [3]:
data = pd.read_csv("/lirneasia/data/lacuna/raw/Survey_data/Survey_wave_1_may_29.csv", low_memory=False)

#### To generate data dictionaries

In [10]:
field_id = 1

with open("wave_1.txt", "w") as file:
    for col in data.columns:
        text = f"'{col}': '{field_id}',"
        file.write(text + "\n")
        field_id += 1

#activating .venv
# go to /lirneasia/projects/lacuna and source .venv/bin/activate

In [4]:
field_id = 1

with open("wave_1.txt", "w") as file:
    for col in data.columns:
        text = f"'{col}',"
        file.write(text + "\n")
        field_id += 1

### Altering household identifier table

In [43]:
mapped_pool = pd.read_csv('/lirneasia/data/lacuna/raw/z_other/survey_pool_mapped.csv')
mapped_pool

      ACCOUNT_NO      ID
0      208949906  ID0001
1      208756405  ID0002
2      202865201  ID0003
3      202792106  ID0004
4      201375702  ID0005
...          ...     ...
7991   604973710  ID7992
7992   602275509  ID7993
7993   601582509  ID7994
7994   606375407  ID7995
7995   601837610  ID7996

[7996 rows x 2 columns]

In [29]:
mapped_pool.to_sql('temp_table', con=engine, if_exists='replace', index=False)

996

In [35]:
query = 'SELECT * from temp_table'

df = pd.read_sql_query(query, engine)

df

      ACCOUNT_NO      ID
0      208949906  ID0001
1      208756405  ID0002
2      202865201  ID0003
3      202792106  ID0004
4      201375702  ID0005
...          ...     ...
7991   604973710  ID7992
7992   602275509  ID7993
7993   601582509  ID7994
7994   606375407  ID7995
7995   601837610  ID7996

[7996 rows x 2 columns]

In [ ]:
# Execute an SQL UPDATE query to match ACCOUNT_NO with customerref and update the ID column

with engine.connect() as connection:
    connection.execute(text("""
        UPDATE raw.household_identifier
        SET customerref = tt."ID" 
        FROM public.temp_table tt
        WHERE tt."ACCOUNT_NO"::text = raw.household_identifier.customerref;
    """))

# Optional: Drop the temporary table after the operation
with engine.connect() as connection:
    connection.execute(text("DROP TABLE IF EXISTS temp_table"))

In [44]:
mapped_pool.to_sql('household_identifier', con=engine, schema='raw', if_exists='replace', index=False)

996